Assignment1/app/controllers/colleges_controller.rb

SELECT "colleges".* FROM "colleges" WHERE (name LIKE '%JNTU%')
---
  def index
    @colleges = College.search(params[:search])

INSERT INTO "colleges" ("name", "established_year", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "JNTU"], ["established_year", 1972], ["created_at", 2016-11-28 12:00:56 UTC], ["updated_at", 2016-11-28 12:00:56 UTC]]
---
  def create
    @college = College.new(college_params)

    respond_to do |format|
      if @college.save

SELECT  "colleges".* FROM "colleges" WHERE "colleges"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
    def set_college
      @college = College.find(params[:id])