Assignment1/app/views/students/filter.html.erb

        %>
        <% if Student::COMPARE_KEYS_MARKS.include? x%>
---
SELECT "students".* FROM "students"